# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

word = 'абв фгбв абв Ура,питон круто,очень интересные семинары!абв'

my_str = word.replace("абв","")
print(my_str)
